listener/Requests/GetRealtimeNewsByProduct.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header>
        <Action soapenv:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">
            http://ifx.ru/IFX3WebService/IIFXService/GetRealtimeNewsByProduct
        </Action>
    </soapenv:Header>
    <soapenv:Body>
        <grnbpmreq xmlns="http://ifx.ru/IFXWebService">
            <direction>0</direction>
            <mbcid i:nil="true" xmlns:i="http://www.w3.org/2001/XMLSchema-instance" />
            <mblnl>0</mblnl>
            <mbsup i:nil="true" xmlns:i="http://www.w3.org/2001/XMLSchema-instance" /> 
        </grnbpmreq>
    </soapenv:Body>
</soapenv:Envelope>